#1.Створіть змінну lvl, яка містить наступні числові елементи: 8, 10, 10, 1, 10, 10, 8, 12, 1, 12.
#Виконайте наступні завдання: обчисліть суму елементів lvl;
#обчисліть середнє елементів lvl; визначте медіану елементів lvl;
#визначте з допомогою R довжину змінної lvl;
#обчисліть стандартне відхилення елементів lvl;
#округліть стандартне відхилення до двох знаків після коми. 
lvl <- c(8,10,10,1,10,10,8,12,1,12)
sum(lvl) - # сума
  mean(lvl) - # середнє
  median(lvl)-# медіана
  length(lvl) - # довжина 
  sd(lvl) - # сандартне відхилення 
  round(sd(lvl),2) - # округлення
  
  
  #Уявимо, що ви відстежуєте пробіг автомобіля після кожної заправки.
  #Після останніх восьмизаправок пробіг був: 65311 65624 65908 66219 66499 66821 67145 67447.
  #Введіть ці числа в R. Використайте функцію diff() до цих даних. Що ви отримаєте як  результат? 
  #Ви  повинні  побачити  кількість  миль  між  заправками. Використайте функцію max(),  mean()  
  #і  min(),
  #щоб обчислити максимальний, середній і мінімальний пробіг між заправками. 
  
  diff(c(65311,65624,65908,66219,66499,66821,67145,67447))
car_oil  <-  c(65311,65624,65908,66219,66499,66821,67145,67447)
sum(car_oil)
mean(diff(c(65311,65624,65908,66219,66499,66821,67145,67447)))  #в середньому заправка йде
#кожні 305 міль

median(diff(c(65311,65624,65908,66219,66499,66821,67145,67447))) # як ми можемо побачити 
# медіана трохи більше за середнє, але +- вои не відрізняються 
max(car_oil)
min(car_oil)
#Функція diff() в R обчислює різницю між послідовними елементами вектора або списку. 
#Вона повертає новий вектор, 
#який містить різниці між кожною парою сусідніх елементів у вхідному векторі.




#Уявіть, що вам потрібно купити устаткування для вашої фабрики і у вас є 2 варіанти для вибору. 
#Перед прийняттям остаточного рішення, ви вибрали 10 показників ефективності з кожного варіанту. 
#Якщо б ваше остаточне рішення будувалося на цих замірах, яке устаткування ви б вибрали? 
#Устаткування 1: 151.2, 150.5, 149.2, 147.5, 152.9, 152.0, 151.3, 149.7, 149.4, 150.7 
#Устаткування 2: 151.9, 151.4, 150.3, 151.2, 151.0, 150.2, 151.2, 151.4, 150.4, 151.7


# Для цього решення задачі, я б хотів побачити, що саме я хочу купити і для чого 
#воно потрібне, якщо на одному оцінка може бути більша , але я розумію, що цей апарат
#мені не такий потрібний, як інший, але в якого оцінка в першій вибірці менша, тоді через це 
#я міг би зробити акцент на другій. Але якщо брати одні числа, скоріш за всього я подивлюсь
#базову сатитстику. Але ми могли б тут застосовувати багато різних гіпоте для перевірок. Манна-Уітні,
#Шапиро Уілка и т.д
library(psych)
ust_1 <-  c(151.2,150.5,149.2,147.5,152.9,152.0,151.3,149.7,149.4,150.7)
ust_2 <-  c(151.9,151.4,150.3,151.2,151.0,150.2,151.2,151.4,150.4,151.7)
ust_1
ust_2
hist(ust_1)
hist(ust_2)
sd(ust_1)
sd(ust_2)
describe(ust_1)
describe(ust_2)
shapiro.test(ust_1)
shapiro.test(ust_2)
#провівши статистику я вибрав би другу вибірку. Через те що стандартне 
#відхилення меньше ніж в першому, це значить те, що меньш числа відрізняються один від одного
#провівши тест шапіро-уілка, я побачив, що більш до нормального росподілення відноситься 
#саме друга вибірка 




#Створіть вектор зросту двадцяти учнів класу:
#100, 106, 121, 111, 109, 111, 103, 117, 114, 108, 111, 105, 120, 116, 104, 
#103, 108, 111,101, 120. Який учень знаходиться посередині цього списку (за зростом)? 
#Який зріст є  найбільш  популярним?Обчисліть ці  величини  засобами  описової аналітики в R. 

len <- c(100,106,121,111,109,111,103,117,114,108,111,105,120,116,104,103,108,111,101,120)
describe(len)
#тут ми можемо побачити, що середнє значення приблизно 110 як і медіана, 
#мінімум = 100б а максимум = 121



#Обчисліть квантилі, квартилі, IQRі стандартну похибку на основі даних з попереднього завдання

quantile(len, probs = c(0.25, 0.5, 0.75))
IQR(len)
boxplot(len)
sd(len)/sqrt(length(len))
#як ми можемо побачити, що і графік box-plot дуже гарної та чіткої форми.
#та загалом побачили точно таку описову статистику як з функції describe


#Розрахуйте стандартне відхилення для даних із завдання
#4 за допомогою формули
#і порівняйте результати
#з використанням функції sd(). Чи будуть результати однакові? 
sd(len)
#так результати однакові, якщо порівнювати з результатом функцій, єдине, що describe 
#округлила значення

#Завантажте  дані  з  двох  стовпців  таблиці  у  два  вектори. 
#Визначтескошеність у даних візуально з використанням засобів розвідувальної аналітики та
#з  допомогою  метрикописової  аналітики. 
#Інтерпретуйте результат

data <- c(212, 586, 869, 760, 220, 495, 654 ,678 ,511, 559, 624, 415, 420, 370, 121, 
659, 428, 119, 865, 288, 799, 241, 405, 787, 230, 522, 670, 207, 870, 160, 366, 
526, 99 ,656, 55 ,848, 489, 720, 312, 676, 493, 581, 163, 929, 221, 653, 84, 661,
144, 770, 48, 800, 375, 529, 86, 975, 168, 995, 100, 947) 
hist(data)
shapiro.test(data)
#Результат тесту Шапіро-Уілка вказує на те,
#наскільки дуже ваші дані відповідають нормальному розподілу. У вашому випадку:
  
#Значення W = 0.9514 - це статистика тесту, де більші значення W 
#вказують на більшу відповідність даних нормальному розподілу.
#p-value = 0.01814 - це ймовірність отримати такий чи більший W при умові,
#що дані мають нормальний розподіл. Зазвичай, якщо p-value менше визначеного
#рівня значущості (наприклад, 0.05), то ми вважаємо результат статистично значущим.
#У вашому випадку p-value менше 0.05, що означає, 
#що є статистично значущі докази того, що ваші дані
#не відповідають нормальному розподілу на рівні значущості 0.05.

#Зауважте, що "близько до нормального" - це поняття, яке не є абсолютним.
#У більшості випадків, якщо p-value менше встановленого рівня значущості (0.05), 
#ми вважаємо, що дані не відповідають нормальному розподілу. 
#Однак, якщо ваш рівень значущості більший або менший, то може бути
#інша інтерпретація результатів.


sd(data) #-стандатне відхилення доволівелике 
boxplot(data) #- боксплот є 'гарним' немає явних викидів, але стандартне відхилення доволі
#велике
describe(data)